public_html/Books Review/ Interview/Cracking the Coding Interview 4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cracking the Coding Interview Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Cracking the Coding Interview Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-08 12:47:48 China Standard Time"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Cracking the Coding Interview Notes</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Site</a></li>
<li><a href="#sec-2">Before the Interview</a>
<ul>
<li><a href="#sec-2-1">What questions should you ask the interviewer?</a></li>
</ul>
</li>
<li><a href="#sec-3">The Interview and Beyond</a>
<ul>
<li><a href="#sec-3-1">Five Steps to a Technical Questions</a></li>
<li><a href="#sec-3-2">Step 1: Ask Questions</a></li>
<li><a href="#sec-3-3">Step 2: Design an Algorithm</a></li>
<li><a href="#sec-3-4">Step 3: Pseudo-Code</a></li>
<li><a href="#sec-3-5">Step 4: Code</a></li>
<li><a href="#sec-3-6">Step 5: Test</a></li>
<li><a href="#sec-3-7">Five Algorithm Approaches</a></li>
</ul>
</li>
<li><a href="#sec-4">Questions</a>
<ul>
<li><a href="#sec-4-1">Chapter 7</a></li>
<li><a href="#sec-4-2">Chapter 8</a></li>
<li><a href="#sec-4-3">Chapter 11</a></li>
<li><a href="#sec-4-4">Chapter 13</a></li>
<li><a href="#sec-4-5">Chapter 14</a></li>
<li><a href="#sec-4-6">Chapter 16</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Site</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="http://www.careercup.com/">http://www.careercup.com/</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Before the Interview</h2>
<div class="outline-text-2" id="text-2">


<p>
Resume screeners look for the same things that interviewers do:
»»Are you smart?
»»Can you code?
</p>
<p>
Writing Strong Bullets: For each role, try to discuss your accomplishments with the following approach: “Accomplished X by implementing Y which led to Z.” Here’s an example:
</p>
<p>
»»“Reduced object rendering time by 75% by applying Floyd’s algorithm, leading to a 10% reduction in system boot time.”
Here’s another example with an alternate wording:
</p>
<p>
»»“Increased average match accuracy from 1.2 to 1.5 by implementing a
new comparison algorithm based on windiff.”
</p>
<p>
Languages: Knowing which languages to list on your resume is always a tricky thing. Do you list everything you’ve ever worked with? Or only the ones that you’re more comfortable with (even though that might only be one or two languages)? I recommend the following compromise: list most languages you’ve used, but add your experience level. This approach is shown below:
</p>
<p>
»»“Languages: Java (expert), C++ (proficient), JavaScript (prior
experience), C (prior experience)”
</p>



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">What questions should you ask the interviewer?</h3>
<div class="outline-text-3" id="text-2-1">

<p>Most interviewers will give you a chance to ask them questions. The quality of your questions will be a factor, whether subconsciously or consciously, in their decisions.
Some questions may come to you during the interview, but you can - and should - prepare questions in advance. Doing research on the company or team may help you with preparing questions.
Questions can be divided into three different categories:
</p>
<p>
Genuine Questions: These are the questions you actually want to know. Here are a few ideas of questions that are valuable to many candidates:
</p>
<ol>
<li>“How much of your day do you spend coding?”
</li>
<li>“How many meetings do you have every week?”
</li>
<li>“What is the ratio of testers to developers to product managers? What is the interaction like? How does project planning happen on the team?”
</li>
</ol>


<p>
Insightful Questions: These questions are designed to demonstrate your deep knowledge of programming or technologies.
</p><ol>
<li>“I noticed that you use technology X. How do you handle problem Y?”
</li>
<li>“Why did the product choose to use the X protocol over the Y protocol? I know it has benefits like A, B, C, but many companies choose not to use it because of issue D.”
</li>
</ol>


<p>
Passion Questions: These questions are designed to demonstrate your passion for technology.
</p><ol>
<li>“I’m very interested in scalability. Did you come in with a background in this, or what opportunities are there to learn about it?”
</li>
<li>“I’m not familiar with technology X, but it sounds like a very interesting solution. Could you tell me a bit more about how it works?”
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The Interview and Beyond</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Five Steps to a Technical Questions</h3>
<div class="outline-text-3" id="text-3-1">

<p>A technical interview question can be solved utilizing a five step approach:
</p><ol>
<li>Ask your interviewer questions to resolve ambiguity.
</li>
<li>Design an Algorithm
</li>
<li>Write pseudo-code first, but make sure to tell your interviewer that you’re writing pseudo-code! Otherwise, he/she may think that you’re never planning to write “real” code, and many interviewers will hold that against you.
</li>
<li>Write your code, not too slow and not too fast.
</li>
<li>Test your code and carefully fix any mistakes.
</li>
</ol>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Step 1: Ask Questions</h3>
<div class="outline-text-3" id="text-3-2">

<p>Good questions might be things like: What are the data types? How much data is there? What assumptions do you need to solve the problem? Who is the user?
Example: “Design an algorithm to sort a list.”
»»Question: What sort of list? An array? A linked list?
»»Answer: An array.
»»Question: What does the array hold? Numbers? Characters? Strings?
»»Answer: Numbers.
»Question: And are the numbers integers?
»»Answer: Yes.
»»Question: Where did the numbers come from? Are they IDs? Values of something?
»»Answer: They are the ages of customers.
»»Question: And how many customers are there?
»»Answer: About a million.
We now have a pretty different problem: sort an array containing a
million integers between 0 and 130. How do we solve this? Just create
an array with 130 elements and count the number of ages at each value.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Step 2: Design an Algorithm</h3>
<div class="outline-text-3" id="text-3-3">

<p>Designing an algorithm can be tough, but our five approaches to algorithms can help you out (see pg 34). While you’re designing your algorithm, don’t forget to think about:
»»What are the space and time complexities?
»»What happens if there is a lot of data?
»»Does your design cause other issues? (i.e., if you’re creating a modified version of a binary search tree, did your design impact the time for insert / find / delete?)
»»If there are other issues, did you make the right trade-offs?
»»If they gave you specific data (e.g., mentioned that the data is
ages, or in sorted order), have you leveraged that information?
There’s probably a reason that you’re given it.
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Step 3: Pseudo-Code</h3>
<div class="outline-text-3" id="text-3-4">

<p>Writing pseudo-code first can help you outline your thoughts clearly
and reduce the number of mistakes you commit. But, make sure to tell
your interviewer that you’re writing pseudo-code first and that you’ll
follow it up with “real” code. Many candidates will write pseudo-code
in order to ‘escape’ writing real code, and you certainly don’t want
to be confused with those candidates.
</p>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Step 4: Code</h3>
<div class="outline-text-3" id="text-3-5">

<p>You don’t need to rush through your code; in fact, this will most likely hurt you. Just go at a nice, slow methodical pace. Also, remember this advice:
»»Use Data Structures Generously: Where relevant, use a good data
structure or define your own. For example, if you’re asked a problem
involving finding the minimum age for a group of people, consider
defining a data structure to represent a Person. This shows your interviewer that you care about good object oriented design.
</p>
<p>
»»Don’t Crowd Your Coding: This is a minor thing, but it can really
help. When you’re writing code on a whiteboard, start in the upper
left hand corner – not in the middle. This will give you plenty of
space to write your answer.
</p>
</div>

</div>
