public_html/Books Review/ Interview/Cracking the Coding Interview 4.html

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">Step 5: Test</h3>
<div class="outline-text-3" id="text-3-6">

<p>Yes, you need to test your code! Consider testing for:
»»Extreme cases: 0, negative, null, maximums, etc
»»User error: What happens if the user passes in null or a negative value?
»»General cases: Test the normal case.
If the algorithm is complicated or highly numerical (bit shifting, arithmetic, etc), consider testing while you’re writing the code rather than just at the end.
Also, when you find mistakes (which you will), carefully think through
why the bug is occuring. One of the worst things I saw while
interviewing was candidates who recognized a mistake and tried making
“random” changes to fix the error.
</p>







</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">Five Algorithm Approaches</h3>
<div class="outline-text-3" id="text-3-7">

<ul>
<li id="sec-3-7-1">APPROACH I: EXAMPLIFY<br/>
Description: Write out specific examples of the problem, and see if
you can figure out a general rule.
</li>
</ul>
<ul>
<li id="sec-3-7-2">APPROACH II: PATTERN MATCHING<br/>
Description: Consider what problems the algorithm is similar to, and
figure out if you can modify the solution to develop an algorithm for
this problem.
</li>
</ul>
<ul>
<li id="sec-3-7-3">APPROACH III: SIMPLIFY &amp; GENERALIZE<br/>
Description: Change a constraint (data type, size, etc) to simplify
the problem. Then try to solve it. Once you have an algorithm for the
“simplified” problem, generalize the problem again.
</li>
</ul>
<ul>
<li id="sec-3-7-4">APPROACH IV: BASE CASE AND BUILD<br/>
Description: Solve the algorithm first for a base case (e.g., just one
element). Then, try to solve it for elements one and two, assuming
that you have the answer for element one. Then, try to solve it for
elements one, two and three, assuming that you have the answer to
elements one and two.
</li>
</ul>
<ul>
<li id="sec-3-7-5">APPROACH V: DATA STRUCTURE BRAINSTORM<br/>
Description: This is hacky, but it often works. Simply run through a list of data structures and try to apply each one.
Example: Numbers are randomly generated and stored into an (expanding) array. How would you keep track of the median?
Data Structure Brainstorm:
»»Linked list? Probably not – linked lists tend not to do very well with accessing and sorting numbers.
»»Array? Maybe, but you already have an array. Could you somehow keep the elements sorted? That’s probably expensive. Let’s hold off on this and return to it if it’s needed.
»»Binary tree? This is possible, since binary trees do fairly well with ordering. In fact, if the binary search tree is perfectly balanced, the top might be the median. But, be careful – if there’s an even number of elements, the median is actually the average of the middle two elements. The middle two elements can’t both be at the top. This is probably a workable algorithm, but let’s come back to it.
»»Heap? A heap is really good at basic ordering and keeping track of max and mins. This is actually interesting – if you had two heaps, you could keep track of the biggest half and the smallest half of the elements. The biggest half is kept in a min heap, such that the smallest element in the biggest half is at the root. The smallest half is kept in a max heap, such that the biggest element of the smallest half is at the root. Now, with these data structures, you have the potential median elements at the roots. If the heaps are no longer the same size, you can quickly “rebalance” the heaps by popping an element off the one heap and pushing it onto the other.
Note that the more problems you do, the better instinct you will
develop about which data structure to apply.


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Questions</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Chapter 7</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li id="sec-4-1-1">7.9<br/>
data block allocation -&gt; “Practical File System Design” or B+ trees
</li>
</ul>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Chapter 8</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li id="sec-4-2-1">8.1 Fibonacci number<br/>
you may read about the (most efficient) matrix-based algorithm at <a href="http://en.wikipedia.org/wiki/Fibonacci_number#Matrix_form">http://en.wikipedia.org/wiki/Fibonacci_number#Matrix_form</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Chapter 11</h3>
<div class="outline-text-3" id="text-4-3">

<p>Elevator algorithms could elimate random bouncing from track to track.
</p>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">Chapter 13</h3>
<div class="outline-text-3" id="text-4-4">

<ul>
<li id="sec-4-4-1">13.5 What is the significance of the keyword “volatile” in C?<br/>

<p>                
SOLUTION
Volatile informs the compiler that the value of the variable can
change from the outside, without any update done by the code.
Declaring a simple volatile variable:
</p>


<pre class="example">volatile int x;
int volatile x;
</pre>

<p>
Declaring a pointer variable for a volatile memory (only the pointer
address is volatile):
</p>


<pre class="example">volatile int * x;
int volatile * x;
</pre>

<p>
Declaring a volatile pointer variable for a non-volatile memory (only
memory contained is volatile):
</p>


<pre class="example">int * volatile x;
</pre>

<p>
Declaring a volatile variable pointer for a volatile memory (both
pointer address and memory contained are volatile):
</p>


<pre class="example">volatile int * volatile x;
int volatile * volatile x;
</pre>

<p>
Volatile variables are not optimized, but this can actually be useful.
Imagine this function:
</p>


<pre class="example">int opt = 1;
void Fn(void) {

start:

if (opt == 1) goto start;

else break;
}
</pre>

<p>
At first glance, our code appears to loop infinitely. The compiler
will try to optimize it to:
</p>


<pre class="example">void Fn(void) {

start:

int opt = 1;

if (true)

goto start;
}
</pre>

<p>
This becomes an infinite loop. However, an external program might
write ‘0’ to the location of variable opt. Volatile variables are also
useful when multi-threaded programs have global variables and any
thread can modify these shared variables. Of course, we don’t want
optimization on them.
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5">Chapter 14</h3>
<div class="outline-text-3" id="text-4-5">

<ul>
<li id="sec-4-5-1">14.4 Explain the difference between templates in C++ and generics in Java.<br/>

<p>        
From <a href="http://en.wikipedia.org/wiki/Comparison_of_Java_and_C++#Templates_vs._Generics">http://en.wikipedia.org/wiki/Comparison_of_Java_and_C%2B%2B#Templates_vs._Generics</a>
</p>

</li>
</ul>
</div>

</div>
